// 스위치 데이터js
export const switchData = [
{'name':'click_blue', 'keypress':'50g+15g', 'title':'경쾌한 클릭음과 리드미컬한 타이핑', 'info':'촉각 및 청각 피드백이 특징입니다. 눈에 띄는 "클릭" 덕분에 Blue는 눈에 보이는 피드백뿐만 아니라 음향 피드백도 제공합니다. 따라서 클릭 기술이 적용된 스위치 중에 가장 인기있는 스위치입니다.'},
{'name':'click_brown', 'keypress':'45g+20g', 'title':'부드럽고 구분감 있는 키감과 조용한 타이핑', 'info':'이 스위치의 특징은 눈에 띄는 피드백이 있다는 것입니다. Brown의 조용한 타이핑사운드와 뚜렷한 피드백은 타이핑 감각을 훈련시켜 전술적', '전략적으로 행동할 수 있도록 도와줍니다.'},
{'name':'linear_red', 'keypress':'45g+15g', 'title':'부드럽고 걸림없는 키감과 조용한 타이핑', 'info':'낮은 스프링 저항과 결합된 선형 스위칭 특성이 직접적으로 트리거됩니다. Red는 기계식 키보드 세계의 초보자를 위한 첫 번째 선택입니다. 원활하게 작동하는 기술은 글쓰기와 게임 세션의 균형을 유지합니다.'},
{'name':'linear_black', 'keypress':'60g+20g', 'title':'부드럽고 걸림없는 묵직한 타이핑', 'info':'증가된 스프링 힘과 결합된 선형 스위칭 특성이 직접적으로 트리거됩니다. 더 강력한 나선형 스프링 덕분에 키를 시작 위치로 부드럽게 이동하고 장시간 글쓰기 및 게임 세션에 필요한 지속력을 제공합니다.'},
{'name':'silent_red', 'keypress':'45g+15g', 'title':'소음을 30%줄인 조용하고 부드러운 타이핑', 'info':'Red와 마찬가지로 SILENT Red도 선형 스위칭 특성이 특징입니다. 특허받은 댐핑 기술로 작동 소음이 확실하게 최소화됩니다. 조용한 CHERRY MX 기술이 적용된 스위치는 낮은 스프링 힘과 부드러운 작동 측면에서 유용합니다.'},
{'name':'silent_silver', 'keypress':'55g+15g', 'title':'다소 높은 키압과 강하고 절도있는 타이핑', 'info':'스위치 제품군 중 가장 빠른 모델입니다. 낮은 스프링 저항과 결합된 선형 스위칭 특성으로 인해 실버 스위치가 직접 트리거됩니다. 밀리초 단위로 승패를 결정할 때 성공적인 게임 세션을 보장합니다.'},
{'name':'nonclick_clear', 'keypress':'45g+15g', 'title':'일반적인 압력의 키압과 고속 타이핑', 'info':'클릭이 필요 없는 스위치인 Clear는 Brown와 유사한 모델입니다. 작동으로 인해 갈색과 회색에 해당하는 완벽한 중심 장식입니다. 견고한 엑조틱 스위치는 매니아들에게 인기 있는 스위치입니다.'},
];